<?php

use Faker\Generator as Faker;

$content = [
    '赞','收藏','结构，内容，语言都好。','实打实，这篇挺有意思，并很有意义。','心态从容愉悦，挺好！','读书和音乐是我最大的爱好了，问好！','喜欢','确实值得思考','欢迎讨论，欢迎批评！','情景交融、物我和谐','回环往复、重章复沓','简练含蓄、词约义丰','雄奇壮伟、慷慨激昂','短促而有力','令人饱含期待与热情，言已尽，意犹未了','细致入微','全文语言铿锵有力，掷地有声，读来令人热血沸腾，心潮澎湃','准确生动，情感丰富而真实','读来津津有味','含蓄隽永，意味深长','构思奇妙','感人肺腑','读来令人爱不释手','行文跌宕起伏，耐人寻味','生动具体','语言流畅，行文舒展自如，自然洒脱','真实感强，立体感强，可读性强，趣味性强','真实感强，立体感强，可读性强，趣味性强','真挚感人','入木三分','语言生动丰富，可读性强','很有新意','很有新意','深刻透彻','铿锵有力，掷地有声','取材新颖，构思奇妙','语言生动活泼','内容生动丰富，语言新颖清爽，结构独特合理','有详有略，言之有序','眉目清晰，生动紧凑','融情于景，边绘景边抒情','言已尽，意犹未了','令人愿读、爱读，不忍释手',
];


$factory->define(App\Models\Reply::class, function (Faker $faker) use ($content){

    // 随机取一个月以内的时间
    $time = $faker->dateTimeThisMonth();

    return [
        'content' => $faker->randomElement($content),
        'created_at' => $time,
        'updated_at' => $time,
        'topic_id' => rand(1, 100),
        'user_id' => rand(1, 20),
    ];
});